package com.paragraph.ea.main.common

object TestConstants {


    const val TEXT_UPLOAD_REQUEST = "Пётр Гринёв родился в семье отставного офицера Андрея Петровича. Андрей Петрович Гринёв — отец Петра, отставной офицер, строгий, прямой. С пяти лет мальчика воспитывал и учил грамоте старый слуга Савельич. Архип Савельич — старый слуга Гринёва, сметливый, хитрый, бережливый, преданный."
    const val RU_LANG_UPLOAD_REQUEST = "ru"
    const val GE_LANG_UPLOAD_REQUEST = "ge"
    const val OFFSET_UPLOAD_REQUEST = 30

    const val SUBJECT_TEXT_CONTENT_RESPONSE = "Пётр Гринёв родился в семье отставного офицера Андрея Петровича. Андрей Петрович Гринёв — отец Петра, отставной офицер, строгий, прямой. С пяти лет мальчика воспитывал и учил грамоте старый слуга Савельич. Архип Савельич — старый слуга Гринёва, сметл"

}